esp8266/Arduino/hardware/sam/system/libsam/cmsis/sam3u/include/component/pmc.h
#define PMC_FSPR_FSTP1 (0x1u << 1) /**< \brief (PMC_FSPR)  */
#define PMC_FSPR_FSTP2 (0x1u << 2) /**< \brief (PMC_FSPR)  */
#define PMC_FSPR_FSTP3 (0x1u << 3) /**< \brief (PMC_FSPR)  */
#define PMC_FSPR_FSTP4 (0x1u << 4) /**< \brief (PMC_FSPR)  */
#define PMC_FSPR_FSTP5 (0x1u << 5) /**< \brief (PMC_FSPR)  */
#define PMC_FSPR_FSTP6 (0x1u << 6) /**< \brief (PMC_FSPR)  */
#define PMC_FSPR_FSTP7 (0x1u << 7) /**< \brief (PMC_FSPR)  */
#define PMC_FSPR_FSTP8 (0x1u << 8) /**< \brief (PMC_FSPR)  */
#define PMC_FSPR_FSTP9 (0x1u << 9) /**< \brief (PMC_FSPR)  */
#define PMC_FSPR_FSTP10 (0x1u << 10) /**< \brief (PMC_FSPR)  */
#define PMC_FSPR_FSTP11 (0x1u << 11) /**< \brief (PMC_FSPR)  */
#define PMC_FSPR_FSTP12 (0x1u << 12) /**< \brief (PMC_FSPR)  */
#define PMC_FSPR_FSTP13 (0x1u << 13) /**< \brief (PMC_FSPR)  */
#define PMC_FSPR_FSTP14 (0x1u << 14) /**< \brief (PMC_FSPR)  */
#define PMC_FSPR_FSTP15 (0x1u << 15) /**< \brief (PMC_FSPR)  */
/* -------- PMC_FOCR : (PMC Offset: 0x0078) Fault Output Clear Register -------- */
#define PMC_FOCR_FOCLR (0x1u << 0) /**< \brief (PMC_FOCR) Fault Output Clear */
/* -------- PMC_WPMR : (PMC Offset: 0xE4) Write Protect Mode Register -------- */
#define PMC_WPMR_WPEN (0x1u << 0) /**< \brief (PMC_WPMR) Write Protect Enable */
#define PMC_WPMR_WPKEY_Pos 8
#define PMC_WPMR_WPKEY_Msk (0xffffffu << PMC_WPMR_WPKEY_Pos) /**< \brief (PMC_WPMR) Write Protect KEY */
#define PMC_WPMR_WPKEY(value) ((PMC_WPMR_WPKEY_Msk & ((value) << PMC_WPMR_WPKEY_Pos)))
/* -------- PMC_WPSR : (PMC Offset: 0xE8) Write Protect Status Register -------- */
#define PMC_WPSR_WPVS (0x1u << 0) /**< \brief (PMC_WPSR) Write Proteact Violation Status */
#define PMC_WPSR_WPVSRC_Pos 8
#define PMC_WPSR_WPVSRC_Msk (0xffffu << PMC_WPSR_WPVSRC_Pos) /**< \brief (PMC_WPSR) Write Protect Violation Source */

/*@}*/


#endif /* _SAM3U_PMC_COMPONENT_ */
